---
kind: method
id: M:Autodesk.Revit.DB.WorksetId.op_GreaterThanOrEqual(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetId)
source: html/f8d62d7a-90da-bbc5-101c-2d566066472d.htm
---
# Autodesk.Revit.DB.WorksetId.op_GreaterThanOrEqual Method

Determines whether one WorksetId is not less than another WorksetId.

## Syntax (C#)
```csharp
public static bool operator >=(
	WorksetId WorksetId1,
	WorksetId WorksetId2
)
```

## Parameters
- **WorksetId1** (`Autodesk.Revit.DB.WorksetId`) - The first WorksetId.
- **WorksetId2** (`Autodesk.Revit.DB.WorksetId`) - The second WorksetId.

## Returns
True if the first WorksetId is not less than the second WorksetId, otherwise, false.